###############################################################################
###############################################################################
###############################################################################

library(shiny)


###############################################################################

shinyUI(fluidPage(
  
  # "nadpis" aplikace ---------------------------------------------------------
  
  titlePanel("Kalkulátor"),
  
  
  # ovládací prvky aplikace (vstupy; levý panel) ------------------------------
  
  sidebarLayout(
    
    sidebarPanel(
      
      strong("Vložte aritmetickou formuli:"),
      
      tags$br(),
      
      HTML(
        paste('<textarea style="height:30px; width:250px;"',
              'id="arithmetic_input"',
              'placeholder="3*5+2..."></textarea>',
              sep = "")
      ),
      
      tags$br(),
      
      submitButton(text = "Spočítej!")
      
      ),
    
    
    ## výstupy; pravý panel ---------------------------------------------------
    
    mainPanel(
       strong("Výsledek aritmetické formule:"),
       tags$br(),
       tags$br(),
       uiOutput("my_output")
    )
  )
))


###############################################################################
###############################################################################
###############################################################################
